paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/lookupCapturedPayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.lookupcapturedpayment">
   <soapenv:Header/>
   <soapenv:Body>
     <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
     <urn:authorization>Bearer 7RDA.3yMKBJrpm.wu-3FPuJ1r7mXqfe6mcIehN64CWE</urn:authorization>
     <urn:captureId>7YK97137TM7104916</urn:captureId>
   </soapenv:Body>
</soapenv:Envelope>
